tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Console Matrix
brew "cmatrix"
# Modern replacement for 'ls'
brew "exa"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Tree
brew "tree"
# Casks
cask "google-chrome"
cask "visual-studio-code"
cask "zoom"
cask "skype"
cask "slack"
# Docker
cask Docker
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Caffeine
cask "caffeine"
# Rectangle is a window management app based on Spectacle, written in Swift.
cask "rectangle"
