brew "act"
brew "ansible"
brew "awscli"
brew "cmatrix"
brew "coreutils"
brew "findutils"
brew "gh"
brew "git-lfs"
brew "htop"
brew "kubectl"
brew "minikube"
brew "nmap"
brew "python@3.12"
brew "python@3.13"
brew "python@3.14"
brew "tmux"
brew "tree"
brew "watch"

cask "caffeine"
cask "cursor"
cask "docker"
cask "google-chrome"
cask "microsoft-outlook"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "wireshark"
cask "zoom"
cask "mactex-no-gui"
