tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Console Matrix
brew "cmatrix"
# Nmap
brew "nmap"
# Findutils, may be installed by default
# brew "findutils"
# Modern replacement for 'ls'
brew "exa"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Tree
brew "tree"
# Latexindent
brew "latexindent"
# Act runs your GitHub Actions locally
brew "act"
# libomp is an OpenMP runtime library, needed for LightGBM
brew "libomp"
# GitHub Copilot on the command line
brew "gh"
# Kubectl
brew "kubectl"
# Minikube
brew "minikube"
# Casks
cask "google-chrome"
cask "visual-studio-code"
cask "zoom"
cask "skype"
cask "microsoft-outlook"
cask "slack"
cask "spotify"
cask "wireshark"
# Docker
cask "docker"
# MacTex
cask "mactex-no-gui"
# Caffeine
cask "caffeine"
# Rectangle is a window management app based on Spectacle, written in Swift.
cask "rectangle"
